In [1]:
import pandas as pd
emp=pd.read_csv("emp_data.csv")
print(emp)

   Name  age  salary
0     a   22    1900
1     b   34    1800
2     c   23    2000
3     d   40    1400
4     a   22    1900
5     b   34    1800
6     c   23    2000
7     d   40    1400
8     a   22    1900
9     b   34    1800
10    c   23    2000
11    d   40    1400
12    a   22    1900
13    b   34    1800
14    c   23    2000
15    d   40    1400

In [3]:
emp.loc[emp["Name"]=="a"]

   Name  age  salary
0     a   22    1900
4     a   22    1900
8     a   22    1900
12    a   22    1900

In [4]:
type(emp)

pandas.core.frame.DataFrame

In [5]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    16 non-null     object
 1   age     16 non-null     int64
 2   salary  16 non-null     int64
dtypes: int64(2), object(1)
memory usage: 512.0+ bytes

In [4]:
emp.head()

  Name  age  salary
0    a   22    1900
1    b   34    1800
2    c   23    2000
3    d   40    1400
4    a   22    1900

In [6]:
emp.head(2)

  Name  age  salary
0    a   22    1900
1    b   34    1800

In [7]:
emp.tail(2)

   Name  age  salary
14    c   23    2000
15    d   40    1400

In [5]:
emp.tail()

   Name  age  salary
11    d   40    1400
12    a   22    1900
13    b   34    1800
14    c   23    2000
15    d   40    1400

In [8]:
emp

   Name  age  salary
0     a   22    1900
1     b   34    1800
2     c   23    2000
3     d   40    1400
4     a   22    1900
5     b   34    1800
6     c   23    2000
7     d   40    1400
8     a   22    1900
9     b   34    1800
10    c   23    2000
11    d   40    1400
12    a   22    1900
13    b   34    1800
14    c   23    2000
15    d   40    1400

In [9]:
emp["age"]

0     22
1     34
2     23
3     40
4     22
5     34
6     23
7     40
8     22
9     34
10    23
11    40
12    22
13    34
14    23
15    40
Name: age, dtype: int64

In [10]:
emp[["age","salary"]]

    age  salary
0    22    1900
1    34    1800
2    23    2000
3    40    1400
4    22    1900
5    34    1800
6    23    2000
7    40    1400
8    22    1900
9    34    1800
10   23    2000
11   40    1400
12   22    1900
13   34    1800
14   23    2000
15   40    1400

In [11]:
emp["age"].max()

40

In [12]:
emp["age"].min()

22

In [13]:
emp["age"].sum()

476

In [14]:
emp["age"]<30

0      True
1     False
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11    False
12     True
13    False
14     True
15    False
Name: age, dtype: bool

In [15]:
emp[emp["age"]<30]

   Name  age  salary
0     a   22    1900
2     c   23    2000
4     a   22    1900
6     c   23    2000
8     a   22    1900
10    c   23    2000
12    a   22    1900
14    c   23    2000

In [16]:
print(emp.loc[2])

Name         c
age         23
salary    2000
Name: 2, dtype: object

In [17]:
import pandas as pd
emp=pd.read_csv("emp_data.csv")
print(emp)

   Name  age  salary
0     a   22    1900
1     b   34    1800
2     c   23    2000
3     d   40    1400
4     a   22    1900
5     b   34    1800
6     c   23    2000
7     d   40    1400
8     a   22    1900
9     b   34    1800
10    c   23    2000
11    d   40    1400
12    a   22    1900
13    b   34    1800
14    c   23    2000
15    d   40    1400

In [18]:
import pandas as pd
l=[10,20,30,40]
pd.Series(l)

0    10
1    20
2    30
3    40
dtype: int64

In [19]:
pd.Series(l,index=['1','2','3','4'])

1    10
2    20
3    30
4    40
dtype: int64

In [20]:
d={'Name':['V','JK','JM'],'Id':[1,2,3]}
pd.DataFrame(d)

  Name  Id
0    V   1
1   JK   2
2   JM   3

In [21]:
import pandas as pd
a=pd.Series()

C:\Users\vanaja\anaconda3\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

In [22]:
a

Series([], dtype: float64)

In [23]:
import numpy as np
import pandas as pd
a=np.array([10,20,30,40])
pd.Series(a)

0    10
1    20
2    30
3    40
dtype: int32

In [24]:
import pandas as pd
l=[10,20,30,40]
pd.Series(l)

0    10
1    20
2    30
3    40
dtype: int64

In [25]:
import pandas as pd
l=[10,20,30,40]
pd.Series(l,index=['a','b','c','d'])

a    10
b    20
c    30
d    40
dtype: int64

In [26]:
import pandas as pd
d={'v':10,'jk':20,'jm':30,'rm':40}
pd.Series(d)

v     10
jk    20
jm    30
rm    40
dtype: int64

In [27]:
import pandas as pd
dt=[('v',10),('jk',20),('jm',30)]
pd.Series(dt)

0     (v, 10)
1    (jk, 20)
2    (jm, 30)
dtype: object

In [28]:
import pandas as pd
df=pd.read_excel("sample.xlsx")
df

XLRDError: Unsupported format, or corrupt file: Expected BOF record; found b',Name,Id'

In [ ]:
d=pd.DataFrame(df)
d

In [ ]:
import pandas as pd
df=pd.read_csv("sample.csv")
df

In [ ]:
d={"Name":['a','b','c'],
   "Id":[1,2,3],
   "Branch":["cse","ece","mech"]}
df=pd.DataFrame(df)
a=pd.DataFrame(d)

In [29]:
a

array([10, 20, 30, 40])

In [30]:
d=[('a',1,'cse'),('b',2,'ece'),('c',3,'mech')]
a=pd.DataFrame(d)

In [31]:
a

   0  1     2
0  a  1   cse
1  b  2   ece
2  c  3  mech

In [1]:
import pandas as pd
a=[1,2,3,4,5,6,7,8,9,10]
a

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [2]:
pd.Series(a)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [4]:
a.index(1)

0

In [5]:
pd.array(a)

<IntegerArray>
[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
Length: 10, dtype: Int64

In [13]:
#mathematical operations
import pandas as pd
a=pd.Series([10,20,30])
b=pd.Series([40,50,60])
a.add(b)

0    50
1    70
2    90
dtype: int64

In [14]:
a.subtract(b)

0   -30
1   -30
2   -30
dtype: int64

In [15]:
a.multiply(b)

0     400
1    1000
2    1800
dtype: int64

In [16]:
a.divide(b)

0    0.25
1    0.40
2    0.50
dtype: float64

In [17]:
a.mod(b)

0    10
1    20
2    30
dtype: int64

In [18]:
a.pow(b)

0   -5047021154770878464
1                      0
2    1152921504606846976
dtype: int64

In [19]:
a.le(b)

0    True
1    True
2    True
dtype: bool

In [20]:
a.gt(b)

0    False
1    False
2    False
dtype: bool

In [24]:
a==b

0    False
1    False
2    False
dtype: bool